//ფესვის ამოყვანა ხდება Math.sqrt(n1, n2)
// n1- ფიცრი და n2 ფესვის მაჩვენებელი  
var n = 3
console.log(n = Math.sqrt(n, 4))


// toFixed(n) ით ხდება დარგვალება ციფრის, 
// nში უწერ რომელ ციფრამდე გინდა დამრგვალგეს მაგალითად- 
// - 3,245 tofixed(2) ით დამრგვალდება მეორე ციფრამდე, (-აქ გაწერილი ციფრი აღნიშნვს რომელ ციფრამდეც უნდა დამრგვალდეს)
// ასევე დამრგვალებისას თუ ბოლოში დასამრგვალებელი ციფრის წინ წერია 5 ან 5ზე მეტი, ის მას შემდეგ რიცხამვდე დაამრგვალებს
var n = 3.245
console.log(n.toFixed(2))


// math.round - ასევე ამრგვალებს მთელ ციფრებამდე, მას არავითარი არგუმენტი არ ენიჭება
// 5 ან 5 ზე მეტზე თუ უეწერია წინა ციფრი ამრგავლებს შემდეგ ციფრამდე, 
// თუ 5ზე ნაკლებია თოვებს წინა ციფრს
var x = Math.round(2.5)
console.log(x)


// math.floor - ამრგვლებს მთელ ციფრებამდე ნაკლებობით 
// მაგ: 2.5 დამრგვალდება 2მდე, აგრეთვე 2.9 დამრგვალდება 2 მდე,
// floor ამრგვალებს ციფრებამდე წინა რიცხვებამდე
var y = Math.floor(2.8)
console.log(y)


// math.ceil ამრგალებს მეტობით
// ისევე მუშაობს როგორც "floor" აგრამ როგორც კი მცირედითაც გადაცდება მთელ რიცხვა, ათწილადს დაამრგვალებს შემდდეგ მთელ ციფრამდე
var m = Math.ceil(3.2)
console.log(m)


// ROUND, FLOOR, CEIL - ამრგვალებს რიოცხვებს მთელ ციფრემბამდე ხოლო 
// toFixed - ამრგვალებს ციფრებს იმ ციფრამდე რომელსაც გავუწერთ

// abs - უარყფით ციფრს აქცევს დადებით ციფრად, ხოლო დადებითს ისევ დადებითად ტოვებს
let h = Math.abs(-200)
console.log(h)